#  Analysing SF Salaries

Author: Suchanya Namwong

Dataset: [SF Salaries Dataset](https://www.kaggle.com/kaggle/sf-salaries)

---

**Import libraries**

In [1]:
import pandas as pd
import numpy as np


**Import the data from the Salaries.csv file as a dataframe, and name the variable as `sal`.**

In [2]:
sal = pd.read_csv('Salaries.csv', low_memory=False)

**Check the head and the tail of the DataFrame.**

In [3]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [4]:
sal.tail()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

**Drop rows with 'Not provided' in any column**

In [5]:
sal = sal[~sal.isin(['Not provided']).any(axis=1)]

In [6]:
sal.tail()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148645,148646,Carolyn A Wilson,Human Services Technician,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148647,148648,Joann Anderson,Communications Dispatcher 2,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148648,148649,Leon Walker,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

**View a summary of the entire data.**

In [7]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 148650 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148650 non-null  int64
 1   EmployeeName      148650 non-null  object
 2   JobTitle          148650 non-null  object
 3   BasePay           148045 non-null  object
 4   OvertimePay       148650 non-null  object
 5   OtherPay          148650 non-null  object
 6   Benefits          112491 non-null  object
 7   TotalPay          148650 non-null  float64
 8   TotalPayBenefits  148650 non-null  float64
 9   Year              148650 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148650 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 15.9+ MB

In [8]:
sal.shape

(148650, 13)

**Convert the string to a numeric data type**

In [9]:
cols_num = ['BasePay', 
     'OvertimePay', 
     'OtherPay', 
     'Benefits', 
     'TotalPay', 
     'TotalPayBenefits']
sal[cols_num] = sal[cols_num].apply(pd.to_numeric, errors='coerce')

**Handling negative values.**

In [10]:
sal = sal.drop(sal[(sal[cols_num] < 0).any(axis=1)].index)

In [11]:
sal.tail()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148644,148645,Randy D Winn,"Stationary Eng, Sewage Plant",0.0,0.0,0.0,0.0,0.0,0.0,2014,NaN,San Francisco,PT
148645,148646,Carolyn A Wilson,Human Services Technician,0.0,0.0,0.0,0.0,0.0,0.0,2014,NaN,San Francisco,PT
148647,148648,Joann Anderson,Communications Dispatcher 2,0.0,0.0,0.0,0.0,0.0,0.0,2014,NaN,San Francisco,PT
148648,148649,Leon Walker,Custodian,0.0,0.0,0.0,0.0,0.0,0.0,2014,NaN,San Francisco,PT
148649,148650,Roy I Tillery,Custodian,0.0,0.0,0.0,0.0,0.0,0.0,2014,NaN,San Francisco,PT

**Handling Missing Values.**

In [12]:
np.sum(sal.isna())

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                602
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148629
Agency                   0
Status              110512
dtype: int64

In [13]:
sal = sal.drop(columns=['Notes'])

In [14]:
sal['Benefits'] = sal['Benefits'].fillna(0)

In [15]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,0.0,567595.43,567595.43,2011,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,0.0,538909.28,538909.28,2011,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,0.0,335279.91,335279.91,2011,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,0.0,332343.61,332343.61,2011,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,0.0,326373.19,326373.19,2011,San Francisco,NaN

**Find the average value of `BasePay`.**

In [16]:
np.mean(sal.BasePay)

66331.42816803692

**What is the highest value of `OvertimePay` in the dataset?**

In [17]:
sal['OvertimePay'].max()

245131.88

**What is the job of JOSEPH DRISCOLL?**

In [18]:
sal.loc[sal['EmployeeName'] == 'JOSEPH DRISCOLL', 'JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

**How much did JOSEPH DRISCOLL earn in total (including benefits)?**

In [19]:
sal.loc[sal['EmployeeName'] == 'JOSEPH DRISCOLL', 'TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

**Who received the most money (including benefits)?**

In [20]:
sal.loc[[sal['TotalPayBenefits'].idxmax(), ]]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,0.0,567595.43,567595.43,2011,San Francisco,NaN

**Who received the least money (including benefits)?**

In [21]:
least_money = sal[sal['TotalPayBenefits'] > 0]['TotalPayBenefits'].idxmin()
sal.loc[[least_money, ]]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency,Status
36155,36156,JOE BROWN JR,TRANSIT OPERATOR,0.0,0.0,0.3,0.0,0.3,0.3,2011,San Francisco,NaN

**Find the average of BasePay for all employees in each year (2011-2014).**

In [22]:
sal.groupby('Year')['BasePay'].apply(lambda x: np.mean(x).round(2)).reset_index()

   Year   BasePay
0  2011  63595.96
1  2012  65456.02
2  2013  69631.07
3  2014  66567.91

**How many unique job titles are there?**

In [23]:
sal['JobTitle'].nunique()

2158

**What are the top 5 positions with the most employees?**

In [24]:
sal['JobTitle'].value_counts().head(6).rename_axis('JobTitle').reset_index(name='Amount')

                       JobTitle  Amount
0              Transit Operator    7036
1                 Special Nurse    4388
2              Registered Nurse    3736
3  Public Svc Aide-Public Works    2518
4                     Custodian    2418
5              Police Officer 3    2418

**How many positions are there with only two employees in 2013?**

In [25]:
np.sum((sal.loc[sal['Year']==2013, 'JobTitle']).value_counts() == 2)

69

**How many people have the word 'Chief' in their job title?**

In [26]:
np.sum(sal['JobTitle'].str.contains('Chief', case=False))

627

**Is there a correlation between length of the Job Title string and Salary?**

In [27]:
sal['title_len'] = sal['JobTitle'].apply(len)

In [28]:
sal[['title_len', 'TotalPayBenefits']].corr()

                  title_len  TotalPayBenefits
title_len          1.000000         -0.037074
TotalPayBenefits  -0.037074          1.000000